{
  "title": "Yıldıray Karasubaşı - Bilgisayar Mühendisi",
  "nav": {
    "home": "Ana Sayfa",
    "education": "Eğitim",
    "experience": "Deneyim",
    "projects": "Projeler",
    "contact": "İletişim"
  },
  "home": {
    "greeting": "Merhaba, Ben Yıldıray",
    "typing": "Bilgisayar Mühendisiyim",
    "description": "Merhaba, ben Yıldıray Karasubaşı. 2025 yılında Bilgisayar Mühendisliği eğitimimi tamamladım. Güçlü analitik düşünme becerilerine, öğrenme isteğine ve işbirlikçi bir zihniyete sahip bir geliştirici olarak, yazılım alanında etkili projeler oluşturmayı hedefliyorum. Teknik becerilerimi sürekli geliştirerek, gelecekte dahil olacağım projelere yenilikçi ve sürdürülebilir katkılar sağlamaya çalışıyorum.",
    "hire": "Bana Ulaşın",
    "downloadCV": "Özgeçmişimi İndirin",
    "downloadPortfolio": "Portfolyomu İndirin"
  },
  "section": {
    "education": "Eğitim",
    "experience": "Deneyim",
    "projects": "Projeler",
    "contact": "İletişim"
  },
  "education": {
    "gpa": "GANO: 3.01 / 4.00",
    "rteu": {
      "name": "Recep Tayyip Erdoğan Üniversitesi",
      "degree": "Bilgisayar Mühendisliği Lisans Derecesi"
    },
    "ibu": {
      "name": "Uluslararası Balkan Üniversitesi (Erasmus)",
      "degree": "Bilgisayar Mühendisliği Lisans Derecesi"
    }
  },
  "experience": {
    "jib": {
      "title": "Kalite Güvence Test Uzmanı / Freelance",
      "company": "JIB Games",
      "period": "Ara 2022 - Şub 2023",
      "description": "Üç ay boyunca freelance QA Test Uzmanı olarak çalıştım. Test senaryoları oluşturdum ve bana atanan test durumlarını yürüttüm, sonuçları detaylı olarak raporladım."
    },
    "kamix": {
      "title": "Yazılım Geliştirici / Kurucu Ortak",
      "company": "KamiX",
      "period": "Kas 2022 - Ağu 2024",
      "description": "Takım arkadaşlarımla birlikte, \"Sürücü İzleme Sistemi\" başlıklı projemizle TEKNOFEST yarışmasının Akıllı Ulaştırma kategorisinde yarıştım. Bu projede görüntü işleme bileşeninden sorumluydum. Final aşamasına başarıyla ilerledik. Ayrıca takım arkadaşlarımla birlikte \"Operasyonel İHA\" projemizi tamamladık. Bu projede otonom kısmı üzerinde çalıştım. Bu proje ile girişimcilik yarışmasında Sanayi ve Teknoloji Bakanı'ndan nakit ödül kazandık."
    },
    "turasas": {
      "title": "Yazılım Geliştirici / Stajyer",
      "company": "Türasaş",
      "period": "Tem 2024 - Ağu 2024",
      "description": "TÜRASAŞ'ta 30 günlük zorunlu yaz stajımı tamamladım. Bilgisayar ağları ve arduino üzerine odaklandım."
    },
    "tubitak": {
      "title": "Yazılım Geliştirici / Tübitak-1001 Bursiyeri",
      "company": "Tübitak",
      "period": "Eki 2024 - Haz 2025",
      "description": "Preeklampsinin erken tespitine yönelik yapay zekâ destekli bir proje için veri toplama ve web geliştirme üzerinde çalıştım."
    },
    "ssb": {
      "title": "Tez Araştırmacısı",
      "company": "SSB - Savunma Sanayii Başkanlığı",
      "period": "Eki 2024 - Haz 2025",
      "description": "Savunma Sanayii Başkanlığı (SSB) ve Yükseköğretim Kurulu (YÖK) koordinasyonunda Savunma Sanayii Yapay Zeka Yetenek Kümesi (SAYZEK) tarafından yürütülen SAYZEK Akademik Tez Programı (ATP) 2024-2025'e kabul edildim ve mezuniyet tezimi bu programla yazdım. Mezuniyet projemde, savaş durumlarında yaralanan askerlere çevrimdışı ilk yardım önerileri sunan yapay zeka entegreli bir mobil uygulama oluşturdum."
    },
    "cerebrum": {
      "title": "Yazılım Geliştirici / Stajyer",
      "company": "Cerebrum Tech",
      "period": "Tem 2025 - Eyl 2025",
      "description": "Cerebrum Tech'te 30 günlük zorunlu yaz stajımı tamamladım. Mobil uygulama geliştirme üzerine odaklandım."
    }
  },
  "projects": {
    "tech": "Teknolojiler:",
    "wordslide": {
      "title": "Word Slide",
      "desc": "Oyuncuların 60 saniye içinde kelimeleri öğrendiği ve doğru ve yanlış cevaplara göre performanslarını takip ettiği çevrimdışı, tek oyunculu İngilizce-Türkçe kelime oyunu.",
      "descLong": "Kullanıcıların İngilizce-Türkçe kelime dağarcığını eğlenceli ve etkili bir şekilde genişletmelerine yardımcı olmak için çevrimdışı, tek oyunculu bir kelime öğrenme oyunu üzerinde çalıştım. Bu projenin amacı, oyuncunun ekranda gösterilen kelimeleri 60 saniye boyunca öğrenmesidir. Oyuncu kelimenin anlamını biliyorsa kart sağa taşınır; bilmiyorsa veya yanlışsa sola taşınır. Turun sonunda sistem, performansı takip etmek için doğru ve yanlış cevapların sayısını gösterir."
    },
    "lostrustykey": {
      "title": "Lost Rusty Key",
      "desc": "Lost Rusty Key, oyuncuların çıkışı açmak için rastgele yerleştirilmiş paslı bir anahtarı aradığı, kısa ve yeniden oynanabilir bir deneyim için keşif ve hafif gerilimi birleştiren bir kaçış temalı oyundur.",
      "descLong": "Lost Rusty Key adında bir kaçış temalı oyun geliştirdim. Oyunda, oyuncu odalardan birinde saklı paslı bir anahtarı arar, çıkışı açar ve kaçmaya çalışır. Oyun her başladığında, paslı anahtar sekiz farklı odadan birinde rastgele belirir, her oynayışta farklı bir deneyim sunar ve yeniden oynanabilirliği artırır. Lost Rusty Key, keşif ve hafif gerilimi birleştirerek oyuncuya kısa ama heyecan verici bir deneyim sunar."
    },
    "bookcollector": {
      "title": "Book Collector",
      "desc": "Book Collector, oyuncuların bir dakika içinde en yüksek skoru hedefleyerek düşen kitapları yakalamak için bir karakteri hareket ettirdiği, basit ama oldukça yeniden oynanabilir oynanış sunan hızlı tempolu bir arcade oyunudur.",
      "descLong": "Book Collector adında bir oyun geliştirdim. Bu oyunda, oyuncu ekranın altındaki bir karakteri kontrol eder, sola ve sağa hareket eder ve yukarıdan düşen kitapları yakalar. Oyunun temel amacı, bir dakika içinde mümkün olduğunca fazla kitap toplamak ve en yüksek skoru elde etmektir. Basit mekanikleri ve hızlı tempolu yapısıyla Book Collector, oyunculara eğlenceli ve rekabetçi bir arcade deneyimi sunar. Oyuncuları her denemede kendi yüksek skorlarını geçmeye teşvik eder ve yüksek yeniden oynanabilirlik sağlar."
    },
    "graduation": {
      "title": "Mezuniyet Projesi",
      "desc": "Yapay Zekâ ile yaralanma fotoğraflarını analiz ederek ve mevcut tıbbi malzemelere göre tedavi önererek askerlere çevrimdışı ilk yardım rehberliği sağlayan, kayıpları azaltmayı amaçlayan bir mobil uygulama.",
      "descLong": "Savaşta yaralanan askerlere ilk yardım önerileri sunan, çevrimdışı çalışan ve internet bağlantısı olmadan doğrudan cihazda çalışan bir mobil uygulama geliştirdim. Bu uygulama ile askerler yaralı bölgenin fotoğrafını yüklediğinde, eğittiğim Yapay Zekâ modeli yara türünü tanımlar ve mevcut tıbbi malzemelere göre uygun ilk yardım önerileri sunar. Bu proje aracılığıyla, en azından kısmen asker kayıplarının sayısını azaltmaya yardımcı olmayı amaçladım."
    },
    "tubitak": {
      "title": "Tübitak-1001 Projesi",
      "desc": "Klinik veri toplama işlemlerini yönettim ve kullanıcı dostu bir web platformu geliştirdim, veri temizleme, AI veri hazırlama ve tam yığın web uygulaması geliştirme konularında deneyim kazandım.",
      "descLong": "Veri toplama ve web platform geliştirme görevlerini üstlendim. Gerçek klinik verilerle çalışarak, veri analizi, veri temizleme ve AI modelleri için veri hazırlama konularında deneyim kazandım. Kullanıcı dostu bir web sitesi geliştirerek, bir web uygulamasının yapısını ve front-end ile back-end'i nasıl entegre edeceğimi öğrendim. Ayrıca AI projelerinde veri işleme ve tam işlevsel web uygulamaları geliştirme konularında pratik deneyim kazandım."
    },
    "uav": {
      "title": "Operasyonel İHA",
      "desc": "Askerlerin dijital taleplerine göre ilk yardım ve mühimmat teslim eden, güvenliği ve operasyonel verimliliği artıran, aynı zamanda zaman ve maliyetleri düşüren otonom bir ikmal İHA sistemi geliştirdim.",
      "descLong": "Askerlerin savaş alanındaki ilk yardım ve mühimmat ihtiyaçlarını daha hızlı, güvenli ve verimli bir şekilde karşılamak için otonom bir ikmal insansız hava aracı geliştirmeyi amaçlayan bir proje üzerinde çalıştım. Bu kapsamda, askerlerin ekibim tarafından tasarlanan bir bileklik aracılığıyla ihtiyaç duydukları malzeme türünü dijital olarak belirtmeleri ve insansız hava aracının bu bilgiyi alması, uygun ikmal paketini seçmesi ve otonom rota planlaması ile teslim etmesi hedeflendi. Projedeki amacım, operasyonel sürekliliği desteklemek, yüksek riskli bölgelerde manuel ikmal ihtiyacını azaltarak personel güvenliğini artırmak ve hem zaman hem de maliyet tasarrufu sağlamaktı. Bu proje için Sanayi ve Teknoloji Bakanı'ndan nakit ödül aldık."
    },
    "driver": {
      "title": "Sürücü İzleme Sistemi",
      "desc": "Takograf sahipliğini doğrulamak ve sürücü uyanıklığını gerçek zamanlı olarak izlemek için yüz tanıma ve AI kullanan entegre bir sistem geliştirdim, kötüye kullanımı önlemeyi ve yol güvenliğini artırmayı amaçladım.",
      "descLong": "Ulaştırma sektöründe, sürücülerin kendi cihazlarının süresi dolduktan sonra başkalarına ait takograf cihazlarını kullanarak sürüşe devam etmeleri hem yasal ihlallere hem de yorgunluk kaynaklı kazaların artmasına neden oluyordu. Bu sorunu çözmek için, yüz tanıma tabanlı takograf doğrulama ve gerçek zamanlı uyku-uyanıklık izleme yapan entegre bir sistem üzerinde çalıştım. Bir sürücü takograf cihazını sisteme tarattığında, araç içi kameranın sürücünün yüzünü analiz etmesini ve cihazın gerçek sahibiyle eşleşip eşleşmediğini kontrol etmesini planladım. Doğrulamadan sonra, sistem AI destekli görüntü işleme teknikleri kullanarak sürüş sırasında sürücünün uyanıklığını gerçek zamanlı olarak izleyecek ve uyuşukluk veya dikkatsizlik tespit edilirse sesli bir uyarı verecekti. Bu projeyle hem takograf kötüye kullanımını önlemeyi hem de sürücü güvenliğini artırmayı amaçladım."
    },
    "teapp": {
      "title": "TÜRASAŞ Çay Uygulaması",
      "desc": "Çalışanların doğrudan sipariş vermesini sağlayan, personel iş yükünü azaltmak ve zaman tasarrufu sağlamak için siparişleri kafeterya ekranında gösteren bir kafeterya sipariş uygulaması geliştirdim.",
      "descLong": "Daha önce staj yaptığım şirkette çalışanların yemek veya içecek siparişi vermek için kafeteryadaki personele telefon etmeleri gerekiyordu. Bu durumu iyileştirmek için, çalışanların herhangi bir personel üyesiyle iletişime geçmeden doğrudan sipariş verebilmelerini sağlayan bir uygulama geliştirdim. Uygulama her çalışanın siparişini kafeterya ekranında gösterdi, böylece personel siparişleri hazırlayıp teslim edebildi. Bu proje hem zaman tasarrufu sağladı hem de kafeterya personelinin iş yükünü önemli ölçüde azalttı."
    },
    "cerebrum": {
      "title": "Cerebrum Tech Staj Projesi",
      "desc": "Ses girişini metne dönüştüren, ChatGPT ile etkileşime giren ve doğal, etkileşimli bir deneyim için yanıtları hem metin hem de ses olarak sunan bir AI sohbet uygulaması geliştirdim.",
      "descLong": "Stajım sırasında bir AI sohbet uygulaması geliştirdim. Uygulama kullanıcıdan gelen ses girişini metne dönüştürür ve ChatGPT ile etkileşime girer. ChatGPT'nin yanıtlarını kullanıcıya hem metin hem de ses olarak sunar, böylece doğal bir iletişim deneyimi oluşturur. Bu projede, konuşma tanıma, metin işleme ve AI entegrasyonunu birleştirerek kullanıcı dostu ve etkileşimli bir uygulama tasarladım."
    }
  },
  "contact": {
    "email": "E-posta",
    "location": "Konum",
    "locationValue": "Sivas, Türkiye",
    "form": {
      "name": "Adınız",
      "email": "E-postanız",
      "message": "Mesajınız",
      "submit": "Mesaj Gönder"
    }
  },
  "footer": {
    "text": "© 2025 Yıldıray Karasubaşı. Tüm hakları saklıdır."
  },
  "alerts": {
    "emailCopied": "E-posta panoya kopyalandı!",
    "emailCopyFailed": "E-posta kopyalanamadı!",
    "messageSent": "Mesaj başarıyla gönderildi!",
    "messageFailed": "Bir hata oluştu. Lütfen tekrar deneyin."
  }
}
